model {
  ssd {
    num_classes: 3
    image_resizer {
      fixed_shape_resizer {
        height: 640
        width: 640
      }
    }
    feature_extractor {
      type: "ssd_resnet50_v1_fpn_keras"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 0.0004
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.03
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.997
          scale: true
          epsilon: 0.001
        }
      }
      override_base_feature_extractor_hyperparams: true
      fpn {
        min_level: 2
        max_level: 7
      }
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      weight_shared_convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 0.0002
            }
          }
          initializer {
            random_normal_initializer {
              mean: 0.0
              stddev: 0.01
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.997
            scale: true
            epsilon: 0.001
          }
        }
        depth: 256
        num_layers_before_predictor: 4
        kernel_size: 3
        class_prediction_bias_init: -4.6
      }
    }
    anchor_generator {
      multiscale_anchor_generator {
        min_level: 2
        max_level: 7
        anchor_scale: 4.0
        aspect_ratios: 0.5
        aspect_ratios: 1.0
        aspect_ratios: 3.0
        
        scales_per_octave: 2
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-08
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
        use_static_shapes: false
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 2.0
          alpha: 0.25
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    encode_background_as_zeros: true
    normalize_loc_loss_by_codesize: true
    inplace_batchnorm_update: true
    freeze_batchnorm: false
  }
}
train_config {
  batch_size: 4

  data_augmentation_options {
    random_distort_color{}
  } 
  data_augmentation_options {
    random_crop_image {
      min_object_covered: 5.0
      min_aspect_ratio: 0.3
      max_aspect_ratio: 5.0
      min_area: 0.3
      max_area: 1.0
      overlap_thresh: 0.2
    }
  }
  sync_replicas: true
  optimizer {
    adam_optimizer {
      learning_rate {
       manual_step_learning_rate
      {
        initial_learning_rate: 0.0001
        schedule
        {
          step: 500
          learning_rate: 0.0001

        }
        
      }
      }
    }
    use_moving_average: false
  }
  
  num_steps: 50000
  startup_delay_steps: 0.0
  replicas_to_aggregate: 8
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "detection"
  use_bfloat16: false
  fine_tune_checkpoint_version: V2
}
train_input_reader {
  label_map_path: "/workspaces/urbar-road-osbtacle-detection/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13840133134545942567_1060_000_1080_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14503113925613619599_975_506_995_506_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1357883579772440606_2365_000_2385_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13679757109245957439_4167_170_4187_170_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18441113814326864765_725_000_745_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1907783283319966632_3221_000_3241_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14004546003548947884_2331_861_2351_861_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14763701469114129880_2260_000_2280_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1918764220984209654_5680_000_5700_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13390791323468600062_6718_570_6738_570_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2036908808378190283_4340_000_4360_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2259324582958830057_3767_030_3787_030_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2206505463279484253_476_189_496_189_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14106113060128637865_1200_000_1220_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1887497421568128425_94_000_114_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14742731916935095621_1325_000_1345_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1172406780360799916_1660_000_1680_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1005081002024129653_5313_150_5333_150_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2114574223307001959_1163_280_1183_280_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14133920963894906769_1480_000_1500_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18286677872269962604_3520_000_3540_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18244334282518155052_2360_000_2380_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13944915979337652825_4260_668_4280_668_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14276116893664145886_1785_080_1805_080_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1432918953215186312_5101_320_5121_320_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18233614482685846350_7060_000_7080_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-200287570390499785_2102_000_2122_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1940032764689855266_3690_210_3710_210_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1972128316147758939_2500_000_2520_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18403940760739364047_920_000_940_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1083056852838271990_4080_000_4100_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1857377326903987736_80_000_100_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14098575914252965554_511_000_531_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2224716024428969146_1420_000_1440_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14193044537086402364_534_000_554_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2025831330434849594_1520_000_1540_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-15832924468527961_1564_160_1584_160_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18418533015310829002_480_000_500_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13940755514149579648_821_157_841_157_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-141184560845819621_10582_560_10602_560_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1382515516588059826_780_000_800_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2088865281951278665_4460_000_4480_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13402473631986525162_5700_000_5720_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14466332043440571514_6530_560_6550_560_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14358192009676582448_3396_400_3416_400_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13909033332341079321_4007_930_4027_930_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18380281348728758158_4820_000_4840_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1231623110026745648_480_000_500_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-204421859195625800_1080_000_1100_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13807633218762107566_6625_000_6645_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14018515129165961775_483_260_503_260_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18136695827203527782_2860_000_2880_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1737018592744049492_1960_000_1980_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14619874262915043759_2801_090_2821_090_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1191788760630624072_3880_000_3900_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-33101359476901423_6720_910_6740_910_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1773696223367475365_1060_000_1080_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2508530288521370100_3385_660_3405_660_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13965460994524880649_2842_050_2862_050_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1473681173028010305_1780_000_1800_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13519445614718437933_4060_000_4080_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1988987616835805847_3500_000_3520_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1305342127382455702_3720_000_3740_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14348136031422182645_3360_000_3380_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14479353969865741728_2340_000_2360_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14753089714893635383_873_600_893_600_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14561791273891593514_2558_030_2578_030_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2415873247906962761_5460_000_5480_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14098605172844003779_5084_630_5104_630_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13731697468004921673_4920_000_4940_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2064489349728221803_3060_000_3080_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14752341928540512649_4960_000_4980_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1921439581405198744_1354_000_1374_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1442753028323350651_4065_000_4085_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14183710428479823719_3140_000_3160_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1730266523558914470_305_260_325_260_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18311996733670569136_5880_000_5900_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1265122081809781363_2879_530_2899_530_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2107164705125601090_3920_000_3940_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14076089808269682731_54_730_74_730_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13629997314951696814_1207_000_1227_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1051897962568538022_238_170_258_170_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13823509240483976870_1514_190_1534_190_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2323851946122476774_7240_000_7260_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14143054494855609923_4529_100_4549_100_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14424804287031718399_1281_030_1301_030_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1352150727715827110_3710_250_3730_250_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2342300897175196823_1179_360_1199_360_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1863454917318776530_1040_000_1060_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2555987917096562599_1620_000_1640_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18025338595059503802_571_216_591_216_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18111897798871103675_320_000_340_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1939881723297238689_6848_040_6868_040_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14250544550818363063_880_000_900_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2151482270865536784_900_000_920_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14734824171146590110_880_000_900_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2209007584159204953_2200_000_2220_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2475623575993725245_400_000_420_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14705303724557273004_3105_000_3125_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-175830748773502782_1580_000_1600_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2217043033232259972_2720_000_2740_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1022527355599519580_4866_960_4886_960_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14388269713149187289_1994_280_2014_280_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14430914081327266277_6480_000_6500_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2336233899565126347_1180_000_1200_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1758724094753801109_1251_037_1271_037_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13622747960068272448_1678_930_1698_930_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2273990870973289942_4009_680_4029_680_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1146261869236413282_1680_000_1700_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14233522945839943589_100_000_120_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-207754730878135627_1140_000_1160_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1255991971750044803_1700_000_1720_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13517115297021862252_2680_000_2700_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1800857743596232165_1500_000_1520_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1891390218766838725_4980_000_5000_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-14766384747691229841_6315_730_6335_730_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13585809231635721258_1910_770_1930_770_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18096167044602516316_2360_000_2380_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1422926405879888210_51_310_71_310_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2265177645248606981_2340_000_2360_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18068531698704694137_920_000_940_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-169115044301335945_480_000_500_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1416654423768444853_2660_000_2680_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2330686858362435307_603_210_623_210_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18295766828140813622_6775_000_6795_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13862220583747475906_1260_000_1280_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-18331713844982117868_2920_900_2940_900_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13506499849906169066_120_000_140_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1605912288178321742_451_000_471_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13984577671034960830_4545_000_4565_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2101027554826767753_2504_580_2524_580_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-2547899409721197155_1380_000_1400_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-13667377240304615855_500_000_520_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-183829460855609442_430_000_450_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/train/segment-1306458236359471795_2524_330_2544_330_with_camera_labels.tfrecord"
  }
}
eval_config {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "/workspaces/urbar-road-osbtacle-detection/label_map.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-18397511418934954408_620_000_640_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-13476374534576730229_240_000_260_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-268278198029493143_1400_000_1420_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-14369250836076988112_7249_040_7269_040_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-1208303279778032257_1360_000_1380_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-2075681641472425669_2635_000_2655_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-16102220208346880_1420_000_1440_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-1999080374382764042_7094_100_7114_100_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-2400780041057579262_660_000_680_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-1926967104529174124_5214_780_5234_780_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-1994338527906508494_3438_100_3458_100_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-13830510593707564159_5575_000_5595_000_with_camera_labels.tfrecord"
    input_path: "/workspaces/urbar-road-osbtacle-detection/data/val/segment-14073491244121877213_4066_056_4086_056_with_camera_labels.tfrecord"
  }
}
