model {
  ssd {
    num_classes: 3
    image_resizer {
      fixed_shape_resizer {
        height: 320
        width: 320
      }
    }
    feature_extractor {
      type: "ssd_resnet50_v1_fpn_keras"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 0.0004
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.03
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.997
          scale: true
          epsilon: 0.001
        }
      }
      override_base_feature_extractor_hyperparams: true
      fpn {
        min_level: 3
        max_level: 8
      }
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      weight_shared_convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 0.0002
            }
          }
          initializer {
            random_normal_initializer {
              mean: 0.0
              stddev: 0.01
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.997
            scale: true
            epsilon: 0.001
          }
        }
        depth: 256
        num_layers_before_predictor: 4
        kernel_size: 3
        class_prediction_bias_init: -4.6
      }
    }
    anchor_generator {
      multiscale_anchor_generator {
        min_level: 3
        max_level: 8
        anchor_scale: 0.9
        aspect_ratios: 1.0
        aspect_ratios: 3.0
        aspect_ratios: 0.5
        scales_per_octave: 2
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-08
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
        use_static_shapes: false
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 2.0
          alpha: 0.25
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    encode_background_as_zeros: true
    normalize_loc_loss_by_codesize: true
    inplace_batchnorm_update: true
    freeze_batchnorm: false
  }
}
train_config {
  batch_size: 2
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_crop_image {
      min_object_covered: 5.0
      min_aspect_ratio: 0.2
      max_aspect_ratio: 5.0
      min_area: 0.2
      max_area: 1.0
      overlap_thresh: 0.1
      random_coef: 0.0
    }
  }
  data_augmentation_options {
    random_image_scale {
      min_scale_ratio: 0.2
      max_scale_ratio: 1.5

    }
  }
    data_augmentation_options {
    random_adjust_contrast {

    }
  }
    data_augmentation_options {
    random_adjust_hue {
      max_delta: 0.05

    }
  }
  sync_replicas: true
  optimizer {
    momentum_optimizer {
      learning_rate {
      manual_step_learning_rate
      {
        initial_learning_rate: 0.001
        schedule
        {
          step: 800
          learning_rate: 0.0001

        }
        schedule
        {
          step: 1500
          learning_rate: 0.00001

        }
        schedule
        {
          step: 2000
          learning_rate: 0.000001

        }

        schedule
        {
          step: 2500
          learning_rate: 0.01

        }
      }
      }
    }
    use_moving_average: false
  }
    num_steps: 3000
  startup_delay_steps: 0.0
  replicas_to_aggregate: 8
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "detection"
  use_bfloat16: false
  fine_tune_checkpoint_version: V2
}
train_input_reader {
  label_map_path: "experiments/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "data/train/segment-11126313430116606120_1439_990_1459_990_with_camera_labels.tfrecord"
    input_path: "data/train/segment-13840133134545942567_1060_000_1080_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-3441838785578020259_1300_000_1320_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-12879640240483815315_5852_605_5872_605_with_camera_labels.tfrecord"
    input_path: "data/train/segment-17850487901509155700_9065_000_9085_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-11139647661584646830_5470_000_5490_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-3247914894323111613_1820_000_1840_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-10017090168044687777_6380_000_6400_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-12339284075576056695_1920_000_1940_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-15482064737890453610_5180_000_5200_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-10023947602400723454_1120_000_1140_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-14503113925613619599_975_506_995_506_with_camera_labels.tfrecord"
    input_path: "data/train/segment-12337317986514501583_5346_260_5366_260_with_camera_labels.tfrecord"
    input_path: "data/train/segment-10107710434105775874_760_000_780_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-16262849101474060261_3459_585_3479_585_with_camera_labels.tfrecord"
    input_path: "data/train/segment-12174529769287588121_3848_440_3868_440_with_camera_labels.tfrecord"
    input_path: "data/train/segment-12896629105712361308_4520_000_4540_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-17761959194352517553_5448_420_5468_420_with_camera_labels.tfrecord"
    input_path: "data/train/segment-2895681525868621979_480_000_500_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-14964131310266936779_3292_850_3312_850_with_camera_labels.tfrecord"
    input_path: "data/train/segment-10786629299947667143_3440_000_3460_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-3132641021038352938_1937_160_1957_160_with_camera_labels.tfrecord"
    input_path: "data/train/segment-1357883579772440606_2365_000_2385_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-12551320916264703416_1420_000_1440_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-13679757109245957439_4167_170_4187_170_with_camera_labels.tfrecord"
    input_path: "data/train/segment-17407069523496279950_4354_900_4374_900_with_camera_labels.tfrecord"
    input_path: "data/train/segment-10082223140073588526_6140_000_6160_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-3451017128488170637_5280_000_5300_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-18441113814326864765_725_000_745_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-15053781258223091665_3192_117_3212_117_with_camera_labels.tfrecord"
    input_path: "data/train/segment-11566385337103696871_5740_000_5760_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-17564868480517233150_3643_000_3663_000_with_camera_labels.tfrecord"
    input_path: "data/train/segment-2577669988012459365_1640_000_1660_000_with_camera_labels.tfrecord"

  }
}
eval_config {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "experiments/label_map.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "data/val/segment-10625026498155904401_200_000_220_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-15578655130939579324_620_000_640_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-18397511418934954408_620_000_640_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-2684088316387726629_180_000_200_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-10094743350625019937_3420_000_3440_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-16121633832852116614_240_000_260_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-16608525782988721413_100_000_120_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-12894036666871194216_787_000_807_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-13476374534576730229_240_000_260_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-2711351338963414257_1360_000_1380_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-12161824480686739258_1813_380_1833_380_with_camera_labels.tfrecord"
    input_path: "data/val/segment-268278198029493143_1400_000_1420_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-14369250836076988112_7249_040_7269_040_with_camera_labels.tfrecord"
    input_path: "data/val/segment-16042886962142359737_1060_000_1080_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-1208303279778032257_1360_000_1380_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-2075681641472425669_2635_000_2655_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-3504776317009340435_6920_000_6940_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-12321865437129862911_3480_000_3500_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-16102220208346880_1420_000_1440_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-16372013171456210875_5631_040_5651_040_with_camera_labels.tfrecord"
    input_path: "data/val/segment-1999080374382764042_7094_100_7114_100_with_camera_labels.tfrecord"
    input_path: "data/val/segment-2400780041057579262_660_000_680_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-12303641360375776820_4378_000_4398_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-3156155872654629090_2474_780_2494_780_with_camera_labels.tfrecord"
    input_path: "data/val/segment-13310437789759009684_2645_000_2665_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-14869732972903148657_2420_000_2440_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-1926967104529174124_5214_780_5234_780_with_camera_labels.tfrecord"
    input_path: "data/val/segment-17790754307864212354_1520_000_1540_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-11971497357570544465_1200_000_1220_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-3418007171190630157_3585_530_3605_530_with_camera_labels.tfrecord"
    input_path: "data/val/segment-13085453465864374565_2040_000_2060_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-1994338527906508494_3438_100_3458_100_with_camera_labels.tfrecord"
    input_path: "data/val/segment-2618605158242502527_1860_000_1880_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-3364861183015885008_1720_000_1740_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-13145971249179441231_1640_000_1660_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-11839652018869852123_2565_000_2585_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-17818548625922145895_1372_430_1392_430_with_camera_labels.tfrecord"
    input_path: "data/val/segment-12251442326766052580_1840_000_1860_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-13830510593707564159_5575_000_5595_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-10940952441434390507_1888_710_1908_710_with_camera_labels.tfrecord"
    input_path: "data/val/segment-14073491244121877213_4066_056_4086_056_with_camera_labels.tfrecord"
    input_path: "data/val/segment-15379350264706417068_3120_000_3140_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-11846396154240966170_3540_000_3560_000_with_camera_labels.tfrecord"
    input_path: "data/val/segment-16646502593577530501_4878_080_4898_080_with_camera_labels.tfrecord"
    input_path: "data/val/segment-10226164909075980558_180_000_200_000_with_camera_labels.tfrecord"
  }
}
